{
  "results": [
    {
      "start": "۱۰",
      "end": "۱۱",
      "name": "داویده اسکاراموتزا",
      "subject": "Learning, Autonomous Vision-based Flight",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "DavideScaramuzza_C80.png",
      "poster_img": "DavideScaramuzza.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "Abstract:\n I will summarize our latest research in learning deep sensorimotor policies for agile vision-based quadrotor flight. Learning sensorimotor policies represents a holistic approach that is more resilient to noisy sensory observations and imperfect world models. However, training robust policies requires a large amount of data. I will show that simulation data is enough to train policies that transfer to the real world without fine-tuning. We achieve one-shot sim-to-real transfer through the appropriate abstraction of sensory observations and control commands. I will show that these learned policies enable autonomous quadrotors to fly faster and more robustly than before, using only onboard cameras and computation. Applications include acrobatics, high-speed navigation in the wild, and autonomous drone racing."
    },
    {
      "start": "۱۲",
      "end": "۱۳",
      "name": "بهداد چالاکی",
      "subject": "A Real-time Motion Planning Framework for Connected and Automated Vehicles: From Theory to Scaled Experiments",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "BehCha_C80.png",
      "poster_img": "BehdadChalaki.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "Traffic congestion has been persistently growing over the last decades in US urban areas since road capacity has not grown at the same pace as the population in urban areas. Additionally, traffic safety is another growing concern. In 2018, there were 6M traffic accidents in the US resulting in more than 35K fatalities and 2.5M people injured. One of the promising ways to mitigate traffic congestion and improve safety is integrating information and communication technologies in cities by utilizing connected and automated vehicles (CAVs). In this talk, we will go through a journey from designing an optimal decentralized coordination framework for CAVs at different traffic bottlenecks to implementing and validating them in a scaled testbed. First, we will establish a general framework for CAVs at multiple adjacent intersections as a common bottleneck in urban areas. Then, we will provide several approaches to enhance the performance of our coordination framework in the presence of uncertainty originated from errors in vehicle-level tracking, noisy measurements, etc. Finally, we will demonstrate the effectiveness of our framework through scaled experiments."
    },
    {
      "start": "۱۵",
      "end": "۱۶",
      "name": "مرتضی امجدی",
      "subject": "Functional Nanomaterial Composites for Soft Sensing and Actuation",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "MortAmj_C80.png",
      "poster_img": "MortezaAmjadi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "Soft machines have many applications, ranging from multifunctional wearable medical devices for feedback therapy to prosthetics, non-invasive surgical tools, and soft robots for safe human-robot interaction. High-performance flexible sensors and actuators are the key components of soft machines. In this talk, I will cover our latest research activities on the development of functional nanocomposites based wearable physical sensors for human motion detection and soft robotics. I will demonstrate how bioinspired structures can help to improve the sensing performance of wearable sensors. The next part of my talk will focus on the development of programmable soft actuators based on composite materials. Finally, I will highlight challenges associated with the design of integrated soft machines capable of multimodal sensing and controlled stimulation.sq"
    },
    {
      "start": "۱۶",
      "end": "۱۷",
      "name": "کامران محسنی",
      "subject": "Observable Divergence Theorem: Wavenumber-infinity Irregularities in Classical Field Equations",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "KamranMohseni_C80.png",
      "poster_img": "KamranMohseni.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "Many classical field equations, including fluid mechanics, elasticity, electromagnetism, etc,  are prone to high wavenumber mode generations as they evolve.  In fluids, this continuous generation of high  wavemodes  results in a cascade of  energy  to an  ever smaller  scales in turbulence,  creation of shocks in compressible flows,  and generation of sharp interfaces in two-phase flows. Similar process is observed in crack propagation in solids and other fields.  Traditionally, this  high wavenumber irregularity is remedied by the addition of a Laplacian term (dissipation term). In this talk, I introduce the concept of  observabilitylimit of field quantities and the consequence of that on the Gauss divergence theorem and Stokes curl theorem. Observable Gauss and Stokes theorems are then derived. These theorems allow the derivation of regularized’ field quantities from basic conservation laws. To this end, observable’  Euler and  Navier-Stokes equations are formally derived. It is expected that these equations simultaneously regularize shocks, turbulence, and sharp interfaces. Several theoretical results (including existence, uniqueness, convergence to entropy solutions, and observable Lie bracket) and numerical simulations will be presented and compared with existing numerical methods. Finally, I will discuss how the observable field theory could be applied in other disciplines involving problems with wavenumber-infinity irregularities such as fracture, crack propagation, sharp interfaces in electromagnetism, etc."
    },
    {
      "start": "۱۷",
      "end": "۱۸",
      "name": "مهدی توکلی",
      "subject": "Human-Robot Authority Sharing in Robot-assisted Medicine via Intelligent Control and Machine Learning",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "MahTav_C80.png",
      "poster_img": "MahdiTavakoli.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "Surgical, therapeutic, diagnostic, and rehabilitative interventions can be significantly enhanced using computer-integrated robotic systems with real-time decision-making capabilities that work under the direct, shared, or supervisory control of medical professionals (surgeons, therapists and physicians). Incorporating appropriate levels of autonomy in systems for healthcare delivery has the potential to lower the mental and physical loads on clinicians while improving the reliability, precision and safety of the interventions for patients. For example, an autonomous system can help to build computerized models of a medical intervention, learned through demonstration by human experts, and transfer the learned skills to a robot that is in charge of providing intelligent assistance to surgeons or therapists. In this seminar, Dr. Mahdi Tavakoli, Professor at the University of Alberta, discusses several applications of medical robotics and their related challenges, and offers solutions based on combining the capabilities of humans with the precision, accuracy, and fast decision-making capabilities of machines."
    },
    {
      "start": "۱۸",
      "end": "۲۰",
      "name": "علیرضا عبدالکریمی",
      "subject": "a workshop over: Robot Operating System",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رباتیک"],
      "speaker_img": "AlirezaAbdolkarimi_C80.png",
      "poster_img": "AlirezaAbdolkarimi.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": ""
    },
    {
      "start": "۱۰",
      "end": "۱۱",
      "name": "امین شکراللهی",
      "subject": "Chord Signaling",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["الگوریتم"],
      "speaker_img": "AmiSho_C80.png",
      "poster_img": "AminShokrollahi.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": "Communication of data on electrical wires between chips is fast gaining prominence in the electronics industry. Because most of the components of the transmitter and the receiver of such links are analog, rather than digital, they don’t benefit as much from Moore’s law. On the other hand, the need to transmit data ever faster calls for higher rates of transmission over existing electrical wires. Since in this type of communication noise is highly frequency dependent, higher transmission rates lead to much higher noise, and therefore a much higher growth of power consumption than linear. The industry has long recognised this problems as the “Interconnect bottleneck”. Fundamental solutions to this important problem have remained elusive, however. A look at the capacity of these channels reveals that today we are only transmitting at anywhere between 1% to 4% of the capacity. Therefore, at least on the surface, there is a lot to be gained by applying methods from communication theory to this problem. However, unlike many other systems such as wireless, DSL, satellite, or optical communication, the constraints on the chip-to-chip communication system are very different: transmission rates are typically 1000 times those encountered in wireless communication. On the other hand, the energy consumed for the transmission and recovery of each bit is about 1000 times less than what is customary in wireless. Also, latency requirements are extremely stringent, allowing only latencies up to very few nanoseconds. Therefore, it is not possible to use fancy processing methods.In this talk I will introduce a new modulation scheme for chip-to-chip communication which we call chordal codes. These codes are somewhat reminiscent of spatial MIMO systems, and provide a first step towards a better utilisation of the available communication bandwidth between chips. Current implementations of systems based on these codes show a large reduction of total power of the communication PHY and a large increase of the communication speed compared to other classical system. "
    },
    {
      "start": "۱۲",
      "end": "۱۴",
      "name": "فاطمه بهاریفرد",
      "subject": "Spanner network and its applications",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["الگوریتم"],
      "speaker_img": "FatemehBaharifard_C80.png",
      "poster_img": "FatemehBaharifard.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "A geometric network G is a t-spanner for a point set P, if a t > 1 exists such that for each pair of points u and v in P, there is a path in G between u and v, whose length is less than or equal to the t times of the Euclidean distance between u and v. The minimum t such that G is a t-spanner for P is stretch factor, or dilation of G. Spanners can be defined in other spaces as well. The quality of a spanner measured by some properties such as size, weight, degree and fault-tolerance. Additionally, the time required to compute such spanners must be as small as possible. Accordingly, different algorithms presented for the construction of spanners with various properties. The construction of sparse spanners has been shown to have numerous application areas such as approximating minimum spanning tree, metric space searching, broadcasting in communication networks, approximation of large graphs in the real world such as social networks, etc."
    },
    {
      "start": "۱۵",
      "end": "۱۶",
      "name": "حسین اسفندیاری",
      "subject": "Recent Academic Research Trends in the Theory of Machine Learning",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["الگوریتم"],
      "speaker_img": "HosEsf_C80.png",
      "poster_img": "HosseinEsfandiari.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "Abstract:  In this talk, we present a few of the recent academic research trends in the theory of machine learning. We first explain, at a high level, a few basic and well-studied problems in machine learning such as clustering, online learning, and feature engineering. Next, we introduce a few challenges in using the classical solutions to these problems in the modern era, such as scalability and transparency. We proceed by presenting some of the new results and techniques to deal with these challenges. Along the way, we propose some open problems in this context."
    },
    {
      "start": "۱۷",
      "end": "۱۸",
      "name": "جواد ابراهیمی",
      "subject": "Heterogeneous Differential Privacy via Graphs",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["الگوریتم"],
      "speaker_img": "JavadEbrahimi_C80.png",
      "poster_img": "JavadEbrahimi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": " In this presentation, we first review the notion of differential privacy. We generalize a previous framework for designing utility-optimal differentially private (DP) mechanisms via graphs, where datasets are vertices in the graph and edges represent dataset neighborhood. The boundary set contains datasets where an individual’s response changes the binary-valued query compared to its neighbors. Previous work was limited to the homogeneous case where the privacy parameter ε across all datasets was the same and the mechanism at boundary datasets was identical. In our work, the mechanism can take different distributions at the boundary and the privacy parameter ε is a function of neighboring datasets, which recovers an earlier definition of personalized DP as a special case. The problem is how to extend the mechanism, which is only defined at the boundary set, to other datasets in the graph in a computationally efficient and utility optimal manner. Using the concept of the strongest induced DP condition we solve this problem efficiently in polynomial time (in the size of the graph)."
    },

    {
      "start": "۱۰",
      "end": "۱۱",
      "name": "شهریار ابراهیمی ",
      "subject": "Practical Cryptography in Blockchain",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "ShahriarEbrahimi_C80.png",
      "poster_img": "ShahriarEbrahimi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "In this talk, we start with an overview of the fundamental building blocks in blockchain. We dive into the details of how different cryptographic schemes are employed to ensure security and robustness of a blockchain. The talk continues focusing more on practical aspects of cryptography in exchanges, such as Hot/Cold wallets, MultiSig accounts, and Deposit/Withdraw processes. Finally, we discuss matter of privacy in blockchain transactions from users’ perspective and its current practices based on Zero-Knowledge Proof (ZKP) protocols and Mixing tools."
    },
    {
      "start": "۱۲",
      "end": "۱۳",
      "name": "سلیل کنهیر",
      "subject": "Transparent, Trustworthy and Privacy-Preserving Supply Chain",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "SalKan_C80.png",
      "poster_img": "SalilKanhere.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "Over the years, supply chains have evolved from a few regional traders to globally complex chains of trade. Consequently, supply chain management systems have become heavily dependent on digitisation for the purpose of data storage and traceability of goods. However, current approaches suffer from issues such as scattering of information across multiple silos, susceptibility of erroneous or untrustworthy data, inability to accurately capture physical events associated with the movement of goods and protection of trade secrets. Our work aims to address above mentioned challenges related to traceability, scalability, trustworthiness, and privacy. To support traceability and provenance, a consortium blockchain based framework, ProductChain, is proposed which provides an immutable audit trail of product's supply chain events and its origin. The framework also presents a sharded network model to meet the scalability needs of complex supply chains. Next, we address the issue of trust associated with the qualities of the commodities and the entities logging data on the blockchain through an extensible framework, TrustChain. TrustChain tracks interactions among supply chain entities and dynamically assigns trust and reputation scores to commodities and traders using smart contracts. For protecting trade secrets, we propose a privacy-preservation framework PrivChain, which allows traders to keep trade related information private and rather return computations or proofs on data to support provenance and traceability claims. The traders are in turn incentivised for providing such proofs. A different privacy-preservation approach for decoupling the identities of traders is explored in TradeChain by managing two ledgers: one for managing decentralised identities and another for recording supply chain events. The information from two ledgers is then collated using access tokens provided by the data owners, i.e., traders themselves. We will conclude the talk with some future directions. "
    },
    {
      "start": "۱۳",
      "end": "۱۴:۳۰",
      "name": "علی حجار",
      "subject": "Basics of Solidity Development",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "AliHajjar_C80.png",
      "poster_img": "AliHajjar.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": ""
    },
    {
      "start": "۱۵",
      "end": "۱۶",
      "name": "سوفیا کلی",
      "subject": "The future of cryptography is coming: post-quantum cryptography",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "SofCel_C80.png",
      "poster_img": "SofiaCeli.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "The future of cryptography is coming: post-quantum cryptography"
    },
    {
      "start": "۱۷",
      "end": "۱۸",
      "name": "امیر مرادی",
      "subject": "امنیت و اجرای رمزنگاری",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "AmirMoradi_C80.png",
      "poster_img": "AmirMoradi.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": "The digital revolution has already changed our lives dramatically, and we are observing the digitalization of almost every piece of our daily life. Digital logic circuits are the foundation of such a revolution, and their integration into our lives implies their access to citizens' private and secret data. Cryptography is obviously a key point to address such concerns, but it is unfortunately not adequate to protect the data which is stored in and processed by a circuit, since physical characteristics and behavior of a circuit has a direct relation to its activities. Examples include its power consumption and its reaction to maliciously-injected faults. As a clear outcome, such digital logic circuits have to be secured as well, since most of them are in control of the original users, who can play the role of an adversary. This talk will review the basics of security of cryptographic implementations. More precisely, the basics of side-channel analysis attacks and mitigation techniques will be presented."
    },
    {
      "start": "۱۹",
      "end": "۲۰",
      "name": "مارک پیلکینگتون",
      "subject": "Blockchain-based smart contracts for shareholder voting",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["رمزنگاری"],
      "speaker_img": "MarcPilkington_C80.png",
      "poster_img": "MarcPilkington.jpg",
      "language": "English",
      "level": "Advanced",
      "description": "In this distinguished invited talk, I shed light on the unforeseen potential of blockchain technology for enhanced corporate governance. I briefly review the seminal literature on the firm, and show that blockchain adoption can be conducive to reduced agency costs. Blockchain can also be used for e-shareholder voting purposes (e.g. at the annual general meeting) and for improved representation of small shareholders. More generally, with democratic principles under assault in an increasing number of nations throughout the world, the blockchain revolution foreshadows a new governance paradigm, democracy 3.0, also called liquid democracy that can be transparency enhancing and corruption minimizing. Pakistan and Dubai constitute two notable e-governance pioneers in this respect."
    },

    {
      "start": "۱۰",
      "end": "۱۱",
      "name": "مهلا علی‌زاده",
      "subject": "آیا کسی رویای هوش‌مصنوعی نامرئی را دارد؟",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "FatemehAlizadeh_C80.png",
      "poster_img": "MahlaAlizadeh.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": "This talk addresses modern intelligent systems that involve complex communication between human and invisible algorithmic actors, raising various ethical, social, and legal challenges that require appropriate design interventions. Social media platforms and authentication systems are examples of such aaplications and demonstrate the complexity of communication between the invisible algorithm and the users of the system. The potential economic benefits of theseemerging approaches ultimately lead to their adoption by most service providers anddevelopers. However, the consequences of such invisible algorithmic processes in their entirety and the appropriate ways to intervene in them are still an open research question.I will therefore present some examples of current negative consequences and discuss how approaches such as user-centred design and speculative design can be used to find alternative pathways that are more transparent, responsive, and allow us to consider possible negative consequences of adoption before such processes are embedded."
    },
    {
      "start": "۱۱",
      "end": "۱۲",
      "name": "محمدحسین بهاری",
      "subject": "Trajectory prediction and planning in self-driving cars, an overview of research in Five AI (Bosch) and academia",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "MHBahari_C80.png",
      "poster_img": "MohammadhosseinBahari.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": "Trajectory prediction and planning in self-driving cars, an overview of research in Five AI (Bosch) and academia Self-driving cars have gained lots of attention in recent years. Due to the enormous transportation change they will bring about, many companies invested in developing the technology, however, existing solutions are still not safe enough for open-world application. In this talk I will cover Five AI (www.five.ai/) solutions for prediction and planning. Five AI is a UK-based start-up working on self-driving tech. It has recently been purchased by Bosch, the largest automotive supplier. Next, I will talk about some of the recent studies about the generalization of trajectory prediction models in VITA lab, EPFL."
    },
    {
      "start": "۱۳",
      "end": "۱۴",
      "name": "نعیمه رنجبر",
      "subject": "An intro to Recommender Systems-case study: how does Netflix recommend movies?",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "NaimeRanjbar_C80.png",
      "poster_img": "NaimeRanjbar.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "In today’s era of big data, we are constantly bombarded with loads of information on the web which  makes it hard for us to find our relevant items or services. This problem is called“information  overload” and we face it in our daily decision makings such as what movie towatch, what news to  read, or what product to buy. Recommender Systems have shown an increasingly significant role in helping users to choose contents  that will meet their needs.In fact, recommender systems meaningfully facilitate the efficient decision  making, and turns the huge amount of different available options from a burden into a benefit. In this talk, I am going to cover such topics as what is a recommender system, what are the most well known applications, what are the main algorithms, how Netflix recommend movies,what are the main  challenges in recommender systems, and what are the future directions for recommender systems.  "
    },
    {
      "start": "۱۵",
      "end": "۱۶",
      "name": "مریم کامگرپور",
      "subject": "Game theory and Reinforcement Learning",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "MaryamKamgarpour_C80.png",
      "poster_img": "MaryamKamgarpour.jpg",
      "level": "Advanced",
      "language": "English",
      "description": "A rising challenge in control of large-scale control systems such as the electricity and the transportation networks is to address autonomous decision making of interacting agents,i.e. the subsystems, with local objectives while ensuring global system safety and performance. In this setting, a Nash equilibrium is a stable solution outcome in the sense that no agent finds it profitable to unilaterally deviate from her decision. Due to geographic distance, privacy concerns or simply the scale of these systems, each agent can only base her decision on local measurements. Hence, a fundamental question is: do agents learn to play a Nash equilibrium strategy based only on local information? I will  discuss conditions under which we have an affirmative answer to this question and will  present algorithms that achieve this learning task. In particular, I will focus on our approach for learning in convex and non-convex games, and in multi-agent reinforcement learning."
    },
    {
      "start": "۱۶:۳۰",
      "end": "۱۸:۳۰",
      "name": "امیرحسین فروغی",
      "subject": " U-Netتقسیم‌بندی عکس پزشکی با استفاده از ",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "AHForougi_C80.png",
      "poster_img": "AmirhosseinForoughi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "Medical image segmentation plays a vital role in computer-aided diagnosis procedures. Medical image segmentation involves the extraction of regions of interest (ROIs) from 3D image data, such as from Magnetic Resonance Imaging (MRI) or Computed Tomography(CT) scans. The main goal of segmenting this data is to identify areas of the anatomy required for a particular study. Recently, U-Net is widely used in medical image segmentation.In this lecture we will see the procedure from data collection and preprocessing and utilizing segmentation-models framework to train a model."
    },
    {
      "start": "۱۹",
      "end": "۲۰",
      "name": "دنیل خشابی",
      "subject": "تحولات اخیر پردازش زبان طبیعی و چالش‌های پیش رو",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "DanielKheshabi_C80.png",
      "poster_img": "DanielKhashabi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "As AI-driven language interfaces (such as chat-bots) become more integrated into our lives, they need to become more versatile and reliable in their communication with human users. What technologies are behind such developments and what are the open challenges? In this talk, I will describe the recent advances in natural language processing, particularly the advent of language models and the different ways it has affected the state of our technology. Then I will focus on the open problems we're facing. I will conclude with my speculations on the future of NLP research toward broader NLP systems by addressing the limitations of the presented ideas and other missing elements needed to move toward more general-purpose interactive language understanding systems. "
    },
    {
      "start": "۲۰",
      "end": "۲۱",
      "name": "ملیکه احقاقی",
      "subject": "Interpretability of Machine Learning Models",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "MalikehEhghaghi_C80.png",
      "poster_img": "MalikehEhghaghi.jpg",
      "language": "Farsi",
      "level": "Advanced",
      "description": ""
    },
    {
      "start": "۲۱",
      "end": "۲۲",
      "name": "حسین مباهی",
      "subject": "Seeking Flat Minima of Training Loss for Improved Generalization",
      "link": "http://Lahzenegar.com/cwsaut/live",
      "categories": ["هوش مصنوعی"],
      "speaker_img": "HosseinMobahi_C80.png",
      "poster_img": "HosseinMobahi.jpg",
      "language": "Farsi",
      "level": "Basic",
      "description": "In today's heavily overparameterized models, the value of the training loss provides few guarantees on model generalization ability. Indeed, optimizing only the training loss value, as is commonly done, can easily lead to suboptimal model quality. Motivated by prior work connecting the geometry of the loss landscape and generalization, we introduce a new and effective procedure for instead simultaneously minimizing loss value and loss sharpness. In particular, our procedure, Sharpness-Aware Minimization (SAM), seeks parameters that lie in neighborhoods having uniformly low loss; this formulation results in a min-max optimization problem on which gradient descent can be performed efficiently. We present empirical results showing that SAM improves model generalization across a variety of benchmark datasets (e.g., CIFAR-10, CIFAR-100, ImageNet, finetuning tasks) and models, yielding novel state-of-the-art performance for several. Additionally, we find that SAM natively provides robustness to label noise on par with that provided by state-of-the-art procedures that specifically target learning with noisy labels. "
    }

  ]
}
